/**
 * SPOILERS
 *
 * This file contains the list of answers for the game. It's not recommended to continue reading this file.
 *
 * 剧透警告
 *
 * 该文件包含了游戏的答案列表。不建议继续阅读。
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 */

import { seedShuffle } from './utils'
import { checkValidIdiom } from '~/logic'

function prepare<T>(len: number, arr: T[]) {
  if (arr.length !== len)
    throw new Error(`expect array length ${arr.length} to be ${len}`)
  return arr
}

export const _PRE = prepare(1, [[]])

export const _2022_JAN = prepare(31, [
  ...Array.from({ length: 28 }, () => []),
  ['天南海北'],
  ['地动山摇'],
  ['福寿安康'],
])

export const _2022_FEB = prepare(28, [
  ['虎虎生威', '虎'],
  ['酒虎诗龙', '虎'],
  ['虎啸风生', '虎'],
  ['卧虎藏龙', '虎'],
  ['虎视眈眈', '虎'],
  ...seedShuffle([
    ['春华秋实'],
    ['一面之辞'],
    ['变化莫测'],
    ['穷山恶水'],
    ['百废待兴'],
    ['百年树人', '人'],
    ['吃里扒外'],
    ['井然有条'],
    ['本性难移'],
    ['口是心非', '是'],
    ['雄心勃勃'],
    ['各有千秋'],
    ['异口同声', '声'],
    ['因噎废食', '食'],
    ['惊世骇俗', '世'],
    ['同甘共苦', '同'],
    ['见风使舵'],
    ['地北天南'],
    ['锦上添花', '花'],
    ['应对如流'],
    ['入木三分', '木'],
    ['瓜田李下', '下'],
    ['语不投机'],
  ], '2022-02'),
])

export const _2022_MARCH = prepare(31, seedShuffle([
  ['孜孜不倦', '不'],
  ['胆战心惊', '心'],
  ['人老珠黄', '黄'],
  ['寄人篱下', '下'],
  ['行尸走肉', '行'],
  ['国泰民安', '安'],
  ['轻声细语', '语'],
  ['自不量力', '力'],
  ['平步青云', '云'],
  ['谈笑风生', '风'],
  ['见义勇为', '为'],
  ['回天乏术', '天'],
  ['首当其冲', '其'],
  ['千姿百态', '百'],
  ['蓬荜生辉', '生'],
  ['苦口婆心', '心'],
  ['独树一帜', '一'],
  ['走马观花', '花'],
  ['燃眉之急', '眉'],
  ['不翼而飞', '飞'],
  ['不言而喻', '言'],
  ['花前月下', '月'],
  ['春风化雨', '风'],
  ['高深莫测', '高'],
  ['铁石心肠', '石'],
  ['飞蛾扑火', '火'],
  ['鬼斧神工', '鬼'],
  ['无中生有', '生'],
  ['风调雨顺', '雨'],
  ['坐吃山空', '山'],
  ['愤世嫉俗', '世'],
], '2022-03'))

export const _2022_APRIL = prepare(30, seedShuffle([
  ['破釜沉舟', '破'],
  ['急转直下', '下'],
  ['独具匠心', '心'],
  ['不耻下问', '下'],
  ['声名鹊起', '名'],
  ['适得其反', '其'],
  ['精益求精', '精'],
  ['无往不利', '不'],
  ['百口莫辩', '口'],
  ['与世无争', '无'],
  ['返老还童', '老'],
  ['火上浇油', '上'],
  ['志在千里', '千'],
  ['闲情逸致', '情'],
  ['敬而远之', '而'],
  ['众目睽睽', '目'],
  ['蝇头小利', '小'],
  ['义结金兰', '金'],
  ['猴年马月', '年'],
  ['排山倒海', '山'],
  ['拾金不昧', '金'],
  ['喜出望外', '出'],
  ['鸡犬不宁', '不'],
  ['身临其境', '其'],
  ['同归于尽', '于'],
  ['杯水车薪', '车'],
  ['日新月异', '日'],
  ['未雨绸缪', '雨'],
  ['居安思危', '安'],
  ['百里挑一', '百'], // D100
], '2022-04'))

export const _2022_MAY = prepare(31, seedShuffle([
  ['昙花一现', '现'],
  ['雪中送炭', '中'],
  ['成王败寇', '成'],
  ['戴罪立功', '立'],
  ['天马行空', '马'],
  ['釜底抽薪', '底'],
  ['既往不咎', '不'],
  ['花容月貌', '月'],
  ['按部就班', '班'],
  ['闭门造车', '门'],
  ['囫囵吞枣', '吞'],
  ['鲜为人知', '人'],
  ['颠三倒四', '四'],
  ['惊弓之鸟', '鸟'],
  ['纸上谈兵', '上'],
  ['今非昔比', '比'],
  ['琳琅满目', '目'],
  ['百家争鸣', '家'],
  ['殊途同归', '同'],
  ['玉石俱焚', '石'],
  ['不寒而栗', '而'],
  ['矢志不渝', '不'],
  ['若无其事', '无'],
  ['普天同庆', '同'],
  ['见仁见智', '见'],
  ['举一反三', '一'],
  ['神出鬼没', '出'],
  ['如履薄冰', '冰'],
  ['口耳相传', '口'],
  ['光阴似箭', '似'],
  ['飞来横祸', '来'],
], '2022-05'))

export const _2022_JUNE = prepare(30, seedShuffle([
  ['雾里看花', '里'],
  ['否极泰来', '来'],
  ['鼠目寸光', '目'],
  ['风起云涌', '云'],
  ['飞檐走壁', '走'],
  ['掩耳盗铃', '耳'],
  ['半信半疑', '半'],
  ['乐不思蜀', '不'],
  ['杯弓蛇影', '影'],
  ['痴人说梦', '人'],
  ['水性杨花', '花'],
  ['塞翁失马', '马'],
  ['背井离乡', '离'],
  ['阴差阳错', '差'],
  ['鸡飞蛋打', '飞'],
  ['入土为安', '为'],
  ['信口雌黄', '口'],
  ['捉襟见肘', '见'],
  ['过河拆桥', '河'],
  ['中流砥柱', '中'],
  ['民不聊生', '生'],
  ['穷困潦倒', '困'],
  ['前功尽弃', '尽'],
  ['上蹿下跳', '下'],
  ['心不在焉', '不'],
  ['德高望重', '重'],
  ['难兄难弟', '兄'],
  ['败兴而归', '兴'],
  ['举手之劳', '手'],
  ['和蔼可亲', '可'],
], '2022-06'))

export const _2022_JULY = prepare(31, seedShuffle([
  ['鳏寡孤独', '独'],
  ['金蝉脱壳', '金'],
  ['做贼心虚', '心'],
  ['南辕北辙', '北'],
  ['大张旗鼓', '大'],
  ['洛阳纸贵', '阳'],
  ['若隐若现', '隐'],
  ['家喻户晓', '家'],
  ['花拳绣腿', '花'],
  ['腰缠万贯', '万'],
  ['缘木求鱼', '鱼'],
  ['日理万机', '万'],
  ['白雪皑皑', '雪'],
  ['拖泥带水', '水'],
  ['博大精深', '大'],
  ['逢凶化吉', '吉'],
  ['欲盖弥彰', '彰'],
  ['循规蹈矩', '循'],
  ['笨鸟先飞', '飞'],
  ['玩世不恭', '不'],
  ['一蹶不振', '不'],
  ['心宽体胖', '心'],
  ['吉光片羽', '光'],
  ['泰然自若', '自'],
  ['酣畅淋漓', '畅'],
  ['头晕目眩', '目'],
  ['左邻右舍', '右'],
  ['集思广益', '思'],
  ['水涨船高', '水'],
  ['藕断丝连', '丝'],
  ['张牙舞爪', '牙'],
], '2022-07'))

export const answers: string[][] = [
  ..._PRE,
  ..._2022_JAN,
  ..._2022_FEB,
  ..._2022_MARCH,
  ..._2022_APRIL,
  ..._2022_MAY,
  ..._2022_JUNE,
  ..._2022_JULY,
]

// duplicated check
if (import.meta.hot) {
  const map = new Map<string, number>()
  answers.forEach((a, i) => {
    if (!a[0])
      return
    if (!map.has(a[0]))
      map.set(a[0], i)
    else
      throw new Error(`Word ${a[0]} is duplicated at ${map.get(a[0])}`)
    if (a[1] && !a[0].includes(a[1]))
      throw new Error(`Hint ${a[1]} is not included in ${a[0]}`)
    if (!checkValidIdiom(a[0], true))
      throw new Error(`${a[0]} is not a valid idiom`)
  })
}
